notes/machin-learning/machine-learing-frameworks/tensorflow/guide/high-level-apis/importing-data.org
#+TITLE: Importing Data 
#+AUTHOR: stupid-coder
#+EMAIL: stupid_coder@163.com
#+STARTUP: indent
#+OPTIONS: num:nil H:2


原文: https://www.tensorflow.org/guide/datasets

#+BEGIN_QUOTE
本文为翻译,用来学习 Tensorflow dataset 机制.
#+END_QUOTE

*tf.data* 提供了简单和可复用的数据读取接口.可以直接读取分布式文件系统上的图像文
件,然后对图像文件进行随机打乱,然后随机选取多张图像作为一个批次,喂给模型训练.也可
以在读取文本信息的同时,从原始数据中抽取符号,然后将这些符号转为对应的嵌入表达
(/embedding/),然后批次送给文本模型.tf.data 可以很容易的读取大量不同格式的数据,调
用不同的数据转换.

tf.data 引入了两个抽象对象:
+ =tf.data.Dataset= :: 用来表示一个数据集,该数据集有多个元素,每个元素可以是一个
     或者多个 *Tensor* 组成.例如:读取图像的输入流,数据集中的元素为一个训练样本,
     该样本由两个张量组成,一个是图像数据,一个是对应的标签.如下为两种构建数据集的
     方法:
  + 从一个或者多个 tf.Tensor 数据源对象构建数据集(Dataset.from_tensor_slices())
  + 从一个或者多个 tf.data.Dataset 上执行转换构建数据集(Dataset.batch())
+ =tf.data.Interator= :: 提供从数据集对象中获取元素的方法. *Iterator.get_next()*
     返回的操作符返回数据集中的下一个样本.最简单的迭代器是 *one-shot iterator* ,
     用来迭代数据集一次.更灵活的用法是,调用 *Iterator.initializer* 操作符来重新
     初始化迭代器,从而可以多次的在不同的数据集上进行数据迭代.

* Basic mechanics
本节主要用来描述创建 Dataset 和 Iteator 对象的用法和获取样本.

首先需要定义数据来源(/source/).例如:从内存中的 Tensor 对象构建 Dataset:
#+BEGIN_SRC python
  tf.data.Dataset.from_tensors()
  # or
  tf.data.Dataset.from_tensor_slices()
#+END_SRC

如果输入数据是在硬盘上,且格式为 *TFRecord* ,可以通过调用
*tf.data.TFRecordDataset* 来构建数据集.

构建 Dataset 对象后,可以调用相关的方法来对输入的数据进行转换.例如可以调用
*Dataset.map()* 方法来对输入的每个样本进行转换(对每个样本执行一个转换函数).或则
调用 *Dataset.batch()* 来使用多个样本构建一个训练批次.可以参考[[https://www.tensorflow.org/api_docs/python/tf/data/Dataset][tf.data.Dataset]]文
档查看转换方法.

从 Dataset 中读取数据的方法是用当前的数据集 Dataset 构建一个迭代其 Iterator,Iterator
提供读取样本数据的方法(Dataset.make_one_shot_iterator()).tf.data.Iterator 迭代器
提供两个操作:Iterator.initializer 用来初始化和重置迭代器;Iterator.get_next()用来
返回数据集中的下一个样本.

** Dataset structure
数据集 Dataset 中的样本元素具有相同的结构.一个样本元素包含一个或者多个 tf.Tensor 对
象,叫做组件(/components/).每个组件都有一个类型 *tf.DType* 和 维度
*tf.TensorShape* . *Dataset.output_types* 和 *Dataset.
_shapes* 用来显示数据集中的样本元素的类型和维度.
#+BEGIN_SRC python
  dataset1 = tf.data.Dataset.from_tensor_slices(tf.random_uniform([4, 10]))
  print(dataset1.output_types)  # ==> "tf.float32"
  print(dataset1.output_shapes)  # ==> "(10,)"

  dataset2 = tf.data.Dataset.from_tensor_slices(
     (tf.random_uniform([4]),
      tf.random_uniform([4, 100], maxval=100, dtype=tf.int32)))
  print(dataset2.output_types)  # ==> "(tf.float32, tf.int32)"
  print(dataset2.output_shapes)  # ==> "((), (100,))"

  dataset3 = tf.data.Dataset.zip((dataset1, dataset2))
  print(dataset3.output_types)  # ==> (tf.float32, (tf.float32, tf.int32))
  print(dataset3.output_shapes)  # ==> "(10, ((), (100,)))"
#+END_SRC

Dataset 也支持对样本元素进行命名,例如:一个样本的不同特征.构建 Dataset 的时候可以使
用字典或者 *collections.namedtuple* 映射命名到 Tensors:
#+BEGIN_SRC python
  dataset = tf.data.Dataset.from_tensor_slices(
      {"a": tf.random_uniform([4]),
       "b": tf.random_uniform([4, 100], maxval=100, dtype=tf.int32)})
  print(dataset.output_types)  # ==> "{'a': tf.float32, 'b': tf.int32}"
  print(dataset.output_shapes)  # ==> "{'a': (), 'b': (100,)}"
#+END_SRC

Dataset 转换支持任意的结构.当使用 *Dataset.map(), Dataset.flat_map(),
Dataset.filter()* 将转换函数作用到每一个样本元素上,函数的参数由样本元素的结构决
定:
#+BEGIN_SRC python
  dataset1 = dataset1.map(lambda x: ...)

  dataset2 = dataset2.flat_map(lambda x, y: ...)

  # Note: Argument destructuring is not available in Python 3.
  dataset3 = dataset3.filter(lambda x, (y, z): ...)
#+END_SRC

