publish/machin-learning/machine-learing-frameworks/tensorflow/guide/high-level-apis/importing-data.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<title>Importing Data</title>
<!-- 2018-10-09 Tue 19:30 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="stupid-coder" />
<link rel="stylesheet" title="Standard" href="/assets/worg.css" type="text/css" />
           <link rel="alternate stylesheet" title="Zenburn" href="/assets/worg-zenburn.css" type="text/css" />
           <link rel="alternate stylesheet" title="Classic" href="/assets/worg-classic.css" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">Importing Data</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Basic mechanics</a>
<ul>
<li><a href="#sec-1-1">Dataset structure</a></li>
<li><a href="#sec-1-2">Creating an iterator</a></li>
<li><a href="#sec-1-3">Consuming values from an iterator</a></li>
<li><a href="#sec-1-4">Saving iterator state</a></li>
</ul>
</li>
<li><a href="#sec-2">Reading input data</a>
<ul>
<li><a href="#sec-2-1">Consuming NumPy arrays</a></li>
<li><a href="#sec-2-2">Consuming TFRecord data</a></li>
<li><a href="#sec-2-3">Consuming text data</a></li>
<li><a href="#sec-2-4">Consuming CSV data</a></li>
</ul>
</li>
<li><a href="#sec-3">Preprocessing data with Dataset.map()</a>
<ul>
<li><a href="#sec-3-1">Parsing tf.Example protocol buffer messages</a></li>
<li><a href="#sec-3-2">Decoding image data and resizing it</a></li>
<li><a href="#sec-3-3">Applying arbitrary Python logic with tf.py_func()</a></li>
</ul>
</li>
<li><a href="#sec-4">Batching dataset elements</a>
<ul>
<li><a href="#sec-4-1">Simple batching</a></li>
<li><a href="#sec-4-2">Batching tensors with padding</a></li>
</ul>
</li>
<li><a href="#sec-5">Training workflows</a>
<ul>
<li><a href="#sec-5-1">Processing multiple epochs</a></li>
<li><a href="#sec-5-2">Randomly shuffling input data</a></li>
<li><a href="#sec-5-3">Using high-level APIs</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
原文: <a href="https://www.tensorflow.org/guide/datasets">https://www.tensorflow.org/guide/datasets</a>
</p>

<blockquote>
<p>
本文为翻译,用来学习 Tensorflow dataset 机制.
</p>
</blockquote>

<p>
<b>tf.data</b> 提供了简单和可复用的数据读取接口.可以直接读取分布式文件系统上的图像文
件,然后对图像文件进行随机打乱,然后随机选取多张图像作为一个批次,喂给模型训练.也可
以在读取文本信息的同时,从原始数据中抽取符号,然后将这些符号转为对应的嵌入表达
(<i>embedding</i>),然后批次送给文本模型.tf.data 可以很容易的读取大量不同格式的数据,调
用不同的数据转换.
</p>

<p>
tf.data 引入了两个抽象对象:
</p>
<dl class="org-dl">
<dt> <code>tf.data.Dataset</code> </dt><dd>用来表示一个数据集,该数据集有多个元素,每个元素可以是一个
或者多个 <b>Tensor</b> 组成.例如:读取图像的输入流,数据集中的元素为一个训练样本,
该样本由两个张量组成,一个是图像数据,一个是对应的标签.如下为两种构建数据集的
方法:
<ul class="org-ul">
<li>从一个或者多个 tf.Tensor 数据源对象构建数据集(Dataset.from_tensor_slices())
</li>
<li>从一个或者多个 tf.data.Dataset 上执行转换构建数据集(Dataset.batch())
</li>
</ul>
</dd>
<dt> <code>tf.data.Interator</code> </dt><dd>提供从数据集对象中获取元素的方法. <b>Iterator.get_next()</b>
返回的操作符返回数据集中的下一个样本.最简单的迭代器是 <b>one-shot iterator</b> ,
用来迭代数据集一次.更灵活的用法是,调用 <b>Iterator.initializer</b> 操作符来重新
初始化迭代器,从而可以多次的在不同的数据集上进行数据迭代.
</dd>
</dl>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Basic mechanics</h2>
<div class="outline-text-2" id="text-1">
<p>
本节主要用来描述创建 Dataset 和 Iteator 对象的用法和获取样本.
</p>

<p>
首先需要定义数据来源(<i>source</i>).例如:从内存中的 Tensor 对象构建 Dataset:
</p>
<div class="org-src-container">

<pre class="src src-python">tf.data.Dataset.from_tensors()
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">or</span>
tf.data.Dataset.from_tensor_slices()
</pre>
</div>

<p>
如果输入数据是在硬盘上,且格式为 <b>TFRecord</b> ,可以通过调用
<b>tf.data.TFRecordDataset</b> 来构建数据集.
</p>

<p>
构建 Dataset 对象后,可以调用相关的方法来对输入的数据进行转换.例如可以调用
<b>Dataset.map()</b> 方法来对输入的每个样本进行转换(对每个样本执行一个转换函数).或则
调用 <b>Dataset.batch()</b> 来使用多个样本构建一个训练批次.可以参考<a href="https://www.tensorflow.org/api_docs/python/tf/data/Dataset">tf.data.Dataset</a>文
档查看转换方法.
</p>

<p>
从 Dataset 中读取数据的方法是用当前的数据集 Dataset 构建一个迭代其 Iterator,Iterator
提供读取样本数据的方法(Dataset.make_one_shot_iterator()).tf.data.Iterator 迭代器
提供两个操作:Iterator.initializer 用来初始化和重置迭代器;Iterator.get_next()用来
返回数据集中的下一个样本.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Dataset structure</h3>
<div class="outline-text-3" id="text-1-1">
<p>
数据集 Dataset 中的样本元素具有相同的结构.一个样本元素包含一个或者多个 tf.Tensor 对
象,叫做组件(<i>components</i>).每个组件都有一个类型 <b>tf.DType</b> 和 维度
<b>tf.TensorShape</b> . <b>Dataset.output_types</b> 和 <b>Dataset.
_shapes</b> 用来显示数据集中的样本元素的类型和维度.
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">dataset1</span> = tf.data.Dataset.from_tensor_slices(tf.random_uniform([4, 10]))
<span style="color: #00bfff; font-weight: bold;">print</span>(dataset1.output_types)  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">==&gt; "tf.float32"</span>
<span style="color: #00bfff; font-weight: bold;">print</span>(dataset1.output_shapes)  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">==&gt; "(10,)"</span>

<span style="font-weight: bold; font-style: italic;">dataset2</span> = tf.data.Dataset.from_tensor_slices(
   (tf.random_uniform([4]),
    tf.random_uniform([4, 100], maxval=100, dtype=tf.int32)))
<span style="color: #00bfff; font-weight: bold;">print</span>(dataset2.output_types)  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">==&gt; "(tf.float32, tf.int32)"</span>
<span style="color: #00bfff; font-weight: bold;">print</span>(dataset2.output_shapes)  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">==&gt; "((), (100,))"</span>

<span style="font-weight: bold; font-style: italic;">dataset3</span> = tf.data.Dataset.<span style="font-weight: bold;">zip</span>((dataset1, dataset2))
<span style="color: #00bfff; font-weight: bold;">print</span>(dataset3.output_types)  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">==&gt; (tf.float32, (tf.float32, tf.int32))</span>
<span style="color: #00bfff; font-weight: bold;">print</span>(dataset3.output_shapes)  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">==&gt; "(10, ((), (100,)))"</span>
</pre>
</div>

<p>
Dataset 也支持对样本元素进行命名,例如:一个样本的不同特征.构建 Dataset 的时候可以使
用字典或者 <b>collections.namedtuple</b> 映射命名到 Tensors:
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">dataset</span> = tf.data.Dataset.from_tensor_slices(
    {<span style="color: #daa520; font-style: italic;">"a"</span>: tf.random_uniform([4]),
     <span style="color: #daa520; font-style: italic;">"b"</span>: tf.random_uniform([4, 100], maxval=100, dtype=tf.int32)})
<span style="color: #00bfff; font-weight: bold;">print</span>(dataset.output_types)  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">==&gt; "{'a': tf.float32, 'b': tf.int32}"</span>
<span style="color: #00bfff; font-weight: bold;">print</span>(dataset.output_shapes)  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">==&gt; "{'a': (), 'b': (100,)}"</span>
</pre>
</div>

<p>
Dataset 转换支持任意的结构.当使用 <b>Dataset.map(), Dataset.flat_map(),
Dataset.filter()</b> 将转换函数作用到每一个样本元素上,函数的参数由样本元素的结构决
定:
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">dataset1</span> = dataset1.<span style="font-weight: bold;">map</span>(<span style="color: #00bfff; font-weight: bold;">lambda</span> x: ...)

<span style="font-weight: bold; font-style: italic;">dataset2</span> = dataset2.flat_map(<span style="color: #00bfff; font-weight: bold;">lambda</span> x, y: ...)

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Note: Argument destructuring is not available in Python 3.</span>
<span style="font-weight: bold; font-style: italic;">dataset3</span> = dataset3.<span style="font-weight: bold;">filter</span>(<span style="color: #00bfff; font-weight: bold;">lambda</span> x, (y, z): ...)
</pre>
</div>
</div>
</div>
