notes/machin-learning/machine-learing-frameworks/tensorflow/guide/high-level-apis/importing-data.org
** Creating an iterator
创建 Dataset 之后,下一步就是创建迭代器 Iterator 来遍历数据集. *tf.data* 接口支持
如下迭代器,以抽象等级增加排列:
- one-shot
- initializable
- reinitializable
- feedable


*one-shot* 是最简单的迭代器,不需要手动初始化,只支持迭代数据集一遍. *one-shot* 迭
代器支持基于队列的输入流,但是不支持参数特化.使用 *Dataset.range()*:
#+BEGIN_SRC python
  dataset = tf.data.Dataset.range(100)
  iterator = dataset.make_one_shot_iterator()
  next_element = iterator.get_next()

  for i in range(100):
    value = sess.run(next_element)
    assert i == value
#+END_SRC

-----
*initializable* 迭代器需要显示的调用迭代器的初始化操作符 *iterator.initializer*
才能使用.可以在初始化接口中以一个或多个参数 *tf.placeholder* 特化 Dataset.如下还
是以 *Dataset.range()* 为例:
#+BEGIN_SRC python
  max_value = tf.placeholder(tf.int64, shape=[])
  dataset = tf.data.Dataset.range(max_value)
  iterator = dataset.make_initializable_iterator()
  next_element = iterator.get_next()

  # Initialize an iterator over a dataset with 10 elements.
  sess.run(iterator.initializer, feed_dict={max_value: 10})
  for i in range(10):
    value = sess.run(next_element)
    assert i == value

  # Initialize the same iterator over a dataset with 100 elements.
  sess.run(iterator.initializer, feed_dict={max_value: 100})
  for i in range(100):
    value = sess.run(next_element)
    assert i == value

#+END_SRC

-----
*reinitializable* 可重置的迭代器可以从不同的 Dataset 对象初始化.例如:可以在训练输
入流中的图片使用随机扰动来提升模型泛化,在验证输入流上预测未修改的图像.
#+BEGIN_SRC python
  # Define training and validation datasets with the same structure.
  training_dataset = tf.data.Dataset.range(100).map(
      lambda x: x + tf.random_uniform([], -10, 10, tf.int64))
  validation_dataset = tf.data.Dataset.range(50)

  # A reinitializable iterator is defined by its structure. We could use the
  # `output_types` and `output_shapes` properties of either `training_dataset`
  # or `validation_dataset` here, because they are compatible.
  iterator = tf.data.Iterator.from_structure(training_dataset.output_types,
                                             training_dataset.output_shapes)
  next_element = iterator.get_next()

  training_init_op = iterator.make_initializer(training_dataset)
  validation_init_op = iterator.make_initializer(validation_dataset)

  # Run 20 epochs in which the training dataset is traversed, followed by the
  # validation dataset.
  for _ in range(20):
    # Initialize an iterator over the training dataset.
    sess.run(training_init_op)
    for _ in range(100):
      sess.run(next_element)

    # Initialize an iterator over the validation dataset.
    sess.run(validation_init_op)
    for _ in range(50):
      sess.run(next_element)
#+END_SRC

-----
*feedable* 迭代器可以和 *tf.placeholder* 一起使用,从而在每次 *tf.Session.run* 中
来选择不同的迭代器使用.功能和 *reinitializable* 迭代器差不多相似,但是不需要每次
都重新初始化.例如:使用上述相同训练集和验证集,可以使用
*tf.data.Iterator.from_string_handle* 来定义 *feedable* 迭代器,从而实现两个数据
集的切换:
#+BEGIN_SRC python
  # Define training and validation datasets with the same structure.
  training_dataset = tf.data.Dataset.range(100).map(
      lambda x: x + tf.random_uniform([], -10, 10, tf.int64)).repeat()
  validation_dataset = tf.data.Dataset.range(50)

  # A feedable iterator is defined by a handle placeholder and its structure. We
  # could use the `output_types` and `output_shapes` properties of either
  # `training_dataset` or `validation_dataset` here, because they have
  # identical structure.
  handle = tf.placeholder(tf.string, shape=[])
  iterator = tf.data.Iterator.from_string_handle(
      handle, training_dataset.output_types, training_dataset.output_shapes)
  next_element = iterator.get_next()

  # You can use feedable iterators with a variety of different kinds of iterator
  # (such as one-shot and initializable iterators).
  training_iterator = training_dataset.make_one_shot_iterator()
  validation_iterator = validation_dataset.make_initializable_iterator()

  # The `Iterator.string_handle()` method returns a tensor that can be evaluated
  # and used to feed the `handle` placeholder.
  training_handle = sess.run(training_iterator.string_handle())
  validation_handle = sess.run(validation_iterator.string_handle())

  # Loop forever, alternating between training and validation.
  while True:
    # Run 200 steps using the training dataset. Note that the training dataset is
    # infinite, and we resume from where we left off in the previous `while` loop
    # iteration.
    for _ in range(200):
      sess.run(next_element, feed_dict={handle: training_handle})

    # Run one pass over the validation dataset.
    sess.run(validation_iterator.initializer)
    for _ in range(50):
      sess.run(next_element, feed_dict={handle: validation_handle})
#+END_SRC

