publish/machin-learning/machine-learing-frameworks/tensorflow/guide/high-level-apis/importing-data.html

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Creating an iterator</h3>
<div class="outline-text-3" id="text-1-2">
<p>
创建 Dataset 之后,下一步就是创建迭代器 Iterator 来遍历数据集. <b>tf.data</b> 接口支持
如下迭代器,以抽象等级增加排列:
</p>
<ul class="org-ul">
<li>one-shot
</li>
<li>initializable
</li>
<li>reinitializable
</li>
<li>feedable
</li>
</ul>


<p>
<b>one-shot</b> 是最简单的迭代器,不需要手动初始化,只支持迭代数据集一遍. <b>one-shot</b> 迭
代器支持基于队列的输入流,但是不支持参数特化.使用 <b>Dataset.range()</b>:
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">dataset</span> = tf.data.Dataset.<span style="font-weight: bold;">range</span>(100)
<span style="font-weight: bold; font-style: italic;">iterator</span> = dataset.make_one_shot_iterator()
<span style="font-weight: bold; font-style: italic;">next_element</span> = iterator.get_next()

<span style="color: #00bfff; font-weight: bold;">for</span> i <span style="color: #00bfff; font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(100):
  <span style="font-weight: bold; font-style: italic;">value</span> = sess.run(next_element)
  <span style="color: #00bfff; font-weight: bold;">assert</span> i == value
</pre>
</div>

<hr  />
<p>
<b>initializable</b> 迭代器需要显示的调用迭代器的初始化操作符 <b>iterator.initializer</b>
才能使用.可以在初始化接口中以一个或多个参数 <b>tf.placeholder</b> 特化 Dataset.如下还
是以 <b>Dataset.range()</b> 为例:
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">max_value</span> = tf.placeholder(tf.int64, shape=[])
<span style="font-weight: bold; font-style: italic;">dataset</span> = tf.data.Dataset.<span style="font-weight: bold;">range</span>(max_value)
<span style="font-weight: bold; font-style: italic;">iterator</span> = dataset.make_initializable_iterator()
<span style="font-weight: bold; font-style: italic;">next_element</span> = iterator.get_next()

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Initialize an iterator over a dataset with 10 elements.</span>
sess.run(iterator.initializer, feed_dict={max_value: 10})
<span style="color: #00bfff; font-weight: bold;">for</span> i <span style="color: #00bfff; font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(10):
  <span style="font-weight: bold; font-style: italic;">value</span> = sess.run(next_element)
  <span style="color: #00bfff; font-weight: bold;">assert</span> i == value

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Initialize the same iterator over a dataset with 100 elements.</span>
sess.run(iterator.initializer, feed_dict={max_value: 100})
<span style="color: #00bfff; font-weight: bold;">for</span> i <span style="color: #00bfff; font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(100):
  <span style="font-weight: bold; font-style: italic;">value</span> = sess.run(next_element)
  <span style="color: #00bfff; font-weight: bold;">assert</span> i == value
</pre>
</div>

<hr  />
<p>
<b>reinitializable</b> 可重置的迭代器可以从不同的 Dataset 对象初始化.例如:可以在训练输
入流中的图片使用随机扰动来提升模型泛化,在验证输入流上预测未修改的图像.
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Define training and validation datasets with the same structure.</span>
<span style="font-weight: bold; font-style: italic;">training_dataset</span> = tf.data.Dataset.<span style="font-weight: bold;">range</span>(100).<span style="font-weight: bold;">map</span>(
    <span style="color: #00bfff; font-weight: bold;">lambda</span> x: x + tf.random_uniform([], -10, 10, tf.int64))
<span style="font-weight: bold; font-style: italic;">validation_dataset</span> = tf.data.Dataset.<span style="font-weight: bold;">range</span>(50)

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">A reinitializable iterator is defined by its structure. We could use the</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">`output_types` and `output_shapes` properties of either `training_dataset`</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">or `validation_dataset` here, because they are compatible.</span>
<span style="font-weight: bold; font-style: italic;">iterator</span> = tf.data.Iterator.from_structure(training_dataset.output_types,
                                           training_dataset.output_shapes)
<span style="font-weight: bold; font-style: italic;">next_element</span> = iterator.get_next()

<span style="font-weight: bold; font-style: italic;">training_init_op</span> = iterator.make_initializer(training_dataset)
<span style="font-weight: bold; font-style: italic;">validation_init_op</span> = iterator.make_initializer(validation_dataset)

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Run 20 epochs in which the training dataset is traversed, followed by the</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">validation dataset.</span>
<span style="color: #00bfff; font-weight: bold;">for</span> _ <span style="color: #00bfff; font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(20):
  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Initialize an iterator over the training dataset.</span>
  sess.run(training_init_op)
  <span style="color: #00bfff; font-weight: bold;">for</span> _ <span style="color: #00bfff; font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(100):
    sess.run(next_element)

  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Initialize an iterator over the validation dataset.</span>
  sess.run(validation_init_op)
  <span style="color: #00bfff; font-weight: bold;">for</span> _ <span style="color: #00bfff; font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(50):
    sess.run(next_element)
</pre>
</div>

<hr  />
<p>
<b>feedable</b> 迭代器可以和 <b>tf.placeholder</b> 一起使用,从而在每次 <b>tf.Session.run</b> 中
来选择不同的迭代器使用.功能和 <b>reinitializable</b> 迭代器差不多相似,但是不需要每次
都重新初始化.例如:使用上述相同训练集和验证集,可以使用
<b>tf.data.Iterator.from_string_handle</b> 来定义 <b>feedable</b> 迭代器,从而实现两个数据
集的切换:
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Define training and validation datasets with the same structure.</span>
<span style="font-weight: bold; font-style: italic;">training_dataset</span> = tf.data.Dataset.<span style="font-weight: bold;">range</span>(100).<span style="font-weight: bold;">map</span>(
    <span style="color: #00bfff; font-weight: bold;">lambda</span> x: x + tf.random_uniform([], -10, 10, tf.int64)).repeat()
<span style="font-weight: bold; font-style: italic;">validation_dataset</span> = tf.data.Dataset.<span style="font-weight: bold;">range</span>(50)

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">A feedable iterator is defined by a handle placeholder and its structure. We</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">could use the `output_types` and `output_shapes` properties of either</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">`training_dataset` or `validation_dataset` here, because they have</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">identical structure.</span>
<span style="font-weight: bold; font-style: italic;">handle</span> = tf.placeholder(tf.string, shape=[])
<span style="font-weight: bold; font-style: italic;">iterator</span> = tf.data.Iterator.from_string_handle(
    handle, training_dataset.output_types, training_dataset.output_shapes)
<span style="font-weight: bold; font-style: italic;">next_element</span> = iterator.get_next()

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">You can use feedable iterators with a variety of different kinds of iterator</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">(such as one-shot and initializable iterators).</span>
<span style="font-weight: bold; font-style: italic;">training_iterator</span> = training_dataset.make_one_shot_iterator()
<span style="font-weight: bold; font-style: italic;">validation_iterator</span> = validation_dataset.make_initializable_iterator()

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">The `Iterator.string_handle()` method returns a tensor that can be evaluated</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">and used to feed the `handle` placeholder.</span>
<span style="font-weight: bold; font-style: italic;">training_handle</span> = sess.run(training_iterator.string_handle())
<span style="font-weight: bold; font-style: italic;">validation_handle</span> = sess.run(validation_iterator.string_handle())

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Loop forever, alternating between training and validation.</span>
<span style="color: #00bfff; font-weight: bold;">while</span> <span style="font-weight: bold; text-decoration: underline;">True</span>:
  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Run 200 steps using the training dataset. Note that the training dataset is</span>
  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">infinite, and we resume from where we left off in the previous `while` loop</span>
  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">iteration.</span>
  <span style="color: #00bfff; font-weight: bold;">for</span> _ <span style="color: #00bfff; font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(200):
    sess.run(next_element, feed_dict={handle: training_handle})

  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Run one pass over the validation dataset.</span>
  sess.run(validation_iterator.initializer)
  <span style="color: #00bfff; font-weight: bold;">for</span> _ <span style="color: #00bfff; font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(50):
    sess.run(next_element, feed_dict={handle: validation_handle})
</pre>
</div>
</div>
</div>
