notes/machin-learning/machine-learing-frameworks/tensorflow/guide/high-level-apis/importing-data.org
** Consuming values from an iterator
*Iterator.get_next()* 返回一个或多个 *tf.Tensor* 对象,这些对像为对应的 Dataset 的
下一个样本元素符号.每次运行这些 Tensors,都会返回对应的下一个样本元素.

一旦 Iterator 迭代到数据集的最后,运行 *Iterator.get_next()* 操作符会抛出
*tf.errors.OutOfRangeError*.需要重新初始化迭代器,才能使用.

#+BEGIN_SRC python
  dataset = tf.data.Dataset.range(5)
  iterator = dataset.make_initializable_iterator()
  next_element = iterator.get_next()

  # Typically `result` will be the output of a model, or an optimizer's
  # training operation.
  result = tf.add(next_element, next_element)

  sess.run(iterator.initializer)
  print(sess.run(result))  # ==> "0"
  print(sess.run(result))  # ==> "2"
  print(sess.run(result))  # ==> "4"
  print(sess.run(result))  # ==> "6"
  print(sess.run(result))  # ==> "8"
  try:
    sess.run(result)
  except tf.errors.OutOfRangeError:
    print("End of dataset")  # ==> "End of dataset"
#+END_SRC

所以,一个常规的使用方法是将训练流程放在 *try-except* 中:
#+BEGIN_SRC python
  sess.run(iterator.initializer)
  while True:
      try:
          sess.run(result)
      except tf.errors.OutOfRangeError:
          break
#+END_SRC

Dataset 中的样本元素为结构化的,所以 *Iterator.get_next()* 返回为一个或多个
*tf.Tensor* 对象:
#+BEGIN_SRC python
  dataset1 = tf.data.Dataset.from_tensor_slices(tf.random_uniform([4, 10]))
  dataset2 = tf.data.Dataset.from_tensor_slices((tf.random_uniform([4]), tf.random_uniform([4, 100])))
  dataset3 = tf.data.Dataset.zip((dataset1, dataset2))

  iterator = dataset3.make_initializable_iterator()

  sess.run(iterator.initializer)
  next1, (next2, next3) = iterator.get_next()
#+END_SRC
next1,next2,next3 为同一个操作符/节点(*Iterator.get_next()*)运行得到的.所以运行
这三个中任意的张量,会运行迭代器向前移动.

** Saving iterator state
*tf.contrib.data.make_saveable_from_iterator* 函数返回迭代器的 *SaveableObject*
,可以用来保存和回复当前迭代器的状态.该对象可以加到 *tf.train.Saver* 变量列表中或
者 *tf.GraphKeys.SAVEABLE_OBJECTS* 集合中,就可以和常规的变量 *tf.variable* 一样
保存和还原了.可以参考[[https://www.tensorflow.org/guide/saved_model][Saving and Restoring]]查看如何保存和还原变量.
#+BEGIN_SRC python
  # Create saveable object from iterator.
  saveable = tf.contrib.data.make_saveable_from_iterator(iterator)

  # Save the iterator state by adding it to the saveable objects collection.
  tf.add_to_collection(tf.GraphKeys.SAVEABLE_OBJECTS, saveable)
  saver = tf.train.Saver()

  with tf.Session() as sess:

    if should_checkpoint:
      saver.save(path_to_checkpoint)

  # Restore the iterator state.
  with tf.Session() as sess:
    saver.restore(sess, path_to_checkpoint)
#+END_SRC

* Reading input data
** Consuming NumPy arrays
如果所有的数据可以存储到内存中,那么最简单创建 Dataset 的方法就是调用
*Dataset.from_tensor_slices* 将内存中的对象转成*tf.Tensor*.
#+BEGIN_SRC python
  # Load the training data into two NumPy arrays, for example using `np.load()`.
  with np.load("/var/data/training_data.npy") as data:
    features = data["features"]
    labels = data["labels"]

  # Assume that each row of `features` corresponds to the same row as `labels`.
  assert features.shape[0] == labels.shape[0]

  dataset = tf.data.Dataset.from_tensor_slices((features, labels))
#+END_SRC

上述的代码就会将内存中的 features 和 labels 数组嵌入 TensorFlow 的图中的
*tf.costant()* 操作符.这种方式比较适合较小的数据集,但是由于需要多次拷贝,所以会浪
费较多的内存.

另外一种方案,可以使用 *tf.placeholder()* 张量定义 Dataset,然后将 NumPy 数组喂给迭
代器:
#+BEGIN_SRC python
  # Load the training data into two NumPy arrays, for example using `np.load()`.
  with np.load("/var/data/training_data.npy") as data:
    features = data["features"]
    labels = data["labels"]

  # Assume that each row of `features` corresponds to the same row as `labels`.
  assert features.shape[0] == labels.shape[0]

  features_placeholder = tf.placeholder(features.dtype, features.shape)
  labels_placeholder = tf.placeholder(labels.dtype, labels.shape)

  dataset = tf.data.Dataset.from_tensor_slices((features_placeholder, labels_placeholder))
  # [Other transformations on `dataset`...]
  dataset = ...
  iterator = dataset.make_initializable_iterator()

  sess.run(iterator.initializer, feed_dict={features_placeholder: features,
                                            labels_placeholder: labels})
#+END_SRC

