publish/machin-learning/machine-learing-frameworks/tensorflow/guide/high-level-apis/importing-data.html

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">Consuming values from an iterator</h3>
<div class="outline-text-3" id="text-1-3">
<p>
<b>Iterator.get_next()</b> 返回一个或多个 <b>tf.Tensor</b> 对象,这些对像为对应的 Dataset 的
下一个样本元素符号.每次运行这些 Tensors,都会返回对应的下一个样本元素.
</p>

<p>
一旦 Iterator 迭代到数据集的最后,运行 <b>Iterator.get_next()</b> 操作符会抛出
<b>tf.errors.OutOfRangeError</b>.需要重新初始化迭代器,才能使用.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">dataset</span> = tf.data.Dataset.<span style="font-weight: bold;">range</span>(5)
<span style="font-weight: bold; font-style: italic;">iterator</span> = dataset.make_initializable_iterator()
<span style="font-weight: bold; font-style: italic;">next_element</span> = iterator.get_next()

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Typically `result` will be the output of a model, or an optimizer's</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">training operation.</span>
<span style="font-weight: bold; font-style: italic;">result</span> = tf.add(next_element, next_element)

sess.run(iterator.initializer)
<span style="color: #00bfff; font-weight: bold;">print</span>(sess.run(result))  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">==&gt; "0"</span>
<span style="color: #00bfff; font-weight: bold;">print</span>(sess.run(result))  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">==&gt; "2"</span>
<span style="color: #00bfff; font-weight: bold;">print</span>(sess.run(result))  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">==&gt; "4"</span>
<span style="color: #00bfff; font-weight: bold;">print</span>(sess.run(result))  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">==&gt; "6"</span>
<span style="color: #00bfff; font-weight: bold;">print</span>(sess.run(result))  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">==&gt; "8"</span>
<span style="color: #00bfff; font-weight: bold;">try</span>:
  sess.run(result)
<span style="color: #00bfff; font-weight: bold;">except</span> tf.errors.OutOfRangeError:
  <span style="color: #00bfff; font-weight: bold;">print</span>(<span style="color: #daa520; font-style: italic;">"End of dataset"</span>)  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">==&gt; "End of dataset"</span>
</pre>
</div>

<p>
所以,一个常规的使用方法是将训练流程放在 <b>try-except</b> 中:
</p>
<div class="org-src-container">

<pre class="src src-python">sess.run(iterator.initializer)
<span style="color: #00bfff; font-weight: bold;">while</span> <span style="font-weight: bold; text-decoration: underline;">True</span>:
    <span style="color: #00bfff; font-weight: bold;">try</span>:
        sess.run(result)
    <span style="color: #00bfff; font-weight: bold;">except</span> tf.errors.OutOfRangeError:
        <span style="color: #00bfff; font-weight: bold;">break</span>
</pre>
</div>

<p>
Dataset 中的样本元素为结构化的,所以 <b>Iterator.get_next()</b> 返回为一个或多个
<b>tf.Tensor</b> 对象:
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">dataset1</span> = tf.data.Dataset.from_tensor_slices(tf.random_uniform([4, 10]))
<span style="font-weight: bold; font-style: italic;">dataset2</span> = tf.data.Dataset.from_tensor_slices((tf.random_uniform([4]), tf.random_uniform([4, 100])))
<span style="font-weight: bold; font-style: italic;">dataset3</span> = tf.data.Dataset.<span style="font-weight: bold;">zip</span>((dataset1, dataset2))

<span style="font-weight: bold; font-style: italic;">iterator</span> = dataset3.make_initializable_iterator()

sess.run(iterator.initializer)
next1, (next2, next3) = iterator.get_next()
</pre>
</div>
<p>
next1,next2,next3 为同一个操作符/节点(<b>Iterator.get_next()</b>)运行得到的.所以运行
这三个中任意的张量,会运行迭代器向前移动.
</p>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">Saving iterator state</h3>
<div class="outline-text-3" id="text-1-4">
<p>
<b>tf.contrib.data.make_saveable_from_iterator</b> 函数返回迭代器的 <b>SaveableObject</b>
,可以用来保存和回复当前迭代器的状态.该对象可以加到 <b>tf.train.Saver</b> 变量列表中或
者 <b>tf.GraphKeys.SAVEABLE_OBJECTS</b> 集合中,就可以和常规的变量 <b>tf.variable</b> 一样
保存和还原了.可以参考<a href="https://www.tensorflow.org/guide/saved_model">Saving and Restoring</a>查看如何保存和还原变量.
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Create saveable object from iterator.</span>
<span style="font-weight: bold; font-style: italic;">saveable</span> = tf.contrib.data.make_saveable_from_iterator(iterator)

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Save the iterator state by adding it to the saveable objects collection.</span>
tf.add_to_collection(tf.GraphKeys.SAVEABLE_OBJECTS, saveable)
<span style="font-weight: bold; font-style: italic;">saver</span> = tf.train.Saver()

<span style="color: #00bfff; font-weight: bold;">with</span> tf.Session() <span style="color: #00bfff; font-weight: bold;">as</span> sess:

  <span style="color: #00bfff; font-weight: bold;">if</span> should_checkpoint:
    saver.save(path_to_checkpoint)

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Restore the iterator state.</span>
<span style="color: #00bfff; font-weight: bold;">with</span> tf.Session() <span style="color: #00bfff; font-weight: bold;">as</span> sess:
  saver.restore(sess, path_to_checkpoint)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Reading input data</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">Consuming NumPy arrays</h3>
<div class="outline-text-3" id="text-2-1">
<p>
如果所有的数据可以存储到内存中,那么最简单创建 Dataset 的方法就是调用
<b>Dataset.from_tensor_slices</b> 将内存中的对象转成*tf.Tensor*.
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Load the training data into two NumPy arrays, for example using `np.load()`.</span>
<span style="color: #00bfff; font-weight: bold;">with</span> np.load(<span style="color: #daa520; font-style: italic;">"/var/data/training_data.npy"</span>) <span style="color: #00bfff; font-weight: bold;">as</span> data:
  <span style="font-weight: bold; font-style: italic;">features</span> = data[<span style="color: #daa520; font-style: italic;">"features"</span>]
  <span style="font-weight: bold; font-style: italic;">labels</span> = data[<span style="color: #daa520; font-style: italic;">"labels"</span>]

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Assume that each row of `features` corresponds to the same row as `labels`.</span>
<span style="color: #00bfff; font-weight: bold;">assert</span> features.shape[0] == labels.shape[0]

<span style="font-weight: bold; font-style: italic;">dataset</span> = tf.data.Dataset.from_tensor_slices((features, labels))
</pre>
</div>

<p>
上述的代码就会将内存中的 features 和 labels 数组嵌入 TensorFlow 的图中的
<b>tf.costant()</b> 操作符.这种方式比较适合较小的数据集,但是由于需要多次拷贝,所以会浪
费较多的内存.
</p>

<p>
另外一种方案,可以使用 <b>tf.placeholder()</b> 张量定义 Dataset,然后将 NumPy 数组喂给迭
代器:
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Load the training data into two NumPy arrays, for example using `np.load()`.</span>
<span style="color: #00bfff; font-weight: bold;">with</span> np.load(<span style="color: #daa520; font-style: italic;">"/var/data/training_data.npy"</span>) <span style="color: #00bfff; font-weight: bold;">as</span> data:
  <span style="font-weight: bold; font-style: italic;">features</span> = data[<span style="color: #daa520; font-style: italic;">"features"</span>]
  <span style="font-weight: bold; font-style: italic;">labels</span> = data[<span style="color: #daa520; font-style: italic;">"labels"</span>]

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Assume that each row of `features` corresponds to the same row as `labels`.</span>
<span style="color: #00bfff; font-weight: bold;">assert</span> features.shape[0] == labels.shape[0]

<span style="font-weight: bold; font-style: italic;">features_placeholder</span> = tf.placeholder(features.dtype, features.shape)
<span style="font-weight: bold; font-style: italic;">labels_placeholder</span> = tf.placeholder(labels.dtype, labels.shape)

<span style="font-weight: bold; font-style: italic;">dataset</span> = tf.data.Dataset.from_tensor_slices((features_placeholder, labels_placeholder))
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">[Other transformations on `dataset`...]</span>
<span style="font-weight: bold; font-style: italic;">dataset</span> = ...
<span style="font-weight: bold; font-style: italic;">iterator</span> = dataset.make_initializable_iterator()

sess.run(iterator.initializer, feed_dict={features_placeholder: features,
                                          labels_placeholder: labels})
</pre>
</div>
</div>
</div>
