notes/machin-learning/machine-learing-frameworks/tensorflow/guide/high-level-apis/importing-data.org
** Consuming TFRecord data
*tf.data* 支持多种文件格式,可以用来处理无法存储在内存中的数据.例如: TFRecord 文
件格式为 TensorFlow 存储的二进制文件格式. *tf.data.TFRecordDataset* 类可以用来流式
遍历 TFRecord 文件:
#+BEGIN_SRC python
  # Creates a dataset that reads all of the examples from two files.
  filenames = ["/var/data/file1.tfrecord", "/var/data/file2.tfrecord"]
  dataset = tf.data.TFRecordDataset(filenames)
#+END_SRC

TFRecordDataset 的初始化参数 filenames 可以是字符串,字符串列表或者字符串的张量.如
果有两个文件,一个训练文件,一个验证文件,那么可以使用 *tf.placeholder(tf.string)*
来代表文件名,采取不同文件名来初始化迭代器:
#+BEGIN_SRC python
  filenames = tf.placeholder(tf.string, shape=[None])
  dataset = tf.data.TFRecordDataset(filenames)
  dataset = dataset.map(...)  # Parse the record into tensors.
  dataset = dataset.repeat()  # Repeat the input indefinitely.
  dataset = dataset.batch(32)
  iterator = dataset.make_initializable_iterator()

  # You can feed the initializer with the appropriate filenames for the current
  # phase of execution, e.g. training vs. validation.

  # Initialize `iterator` with training data.
  training_filenames = ["/var/data/file1.tfrecord", "/var/data/file2.tfrecord"]
  sess.run(iterator.initializer, feed_dict={filenames: training_filenames})

  # Initialize `iterator` with validation data.
  validation_filenames = ["/var/data/validation1.tfrecord", ...]
  sess.run(iterator.initializer, feed_dict={filenames: validation_filenames})
#+END_SRC

** Consuming text data
*tf.data.TextLineDataset* 用来支持从文本文件创建 Dataset.类似 TFRecordDataset 一
 样,可以接受一个 *tf.Tensor* 作为 filenames,然后参数特化迭代器:
#+BEGIN_SRC python
  filenames = ["/var/data/file1.txt", "/var/data/file2.txt"]
  dataset = tf.data.TextLineDataset(filenames)
#+END_SRC

默认 TextLineDataset 会将文本文件中的每一行作为一个样本,有时候第一行有可能是描述
行,或者包含一些注视.这些行可以通过调用 *Dataset.skip()* 和 *Dataset.filter()* 转
换函数来过滤掉.可以调用 *Dataset.flat_map()* 来分别过滤对应文件的 Dataset:
#+BEGIN_SRC python
  filenames = ["/var/data/file1.txt", "/var/data/file2.txt"]

  dataset = tf.data.Dataset.from_tensor_slices(filenames)

  # Use `Dataset.flat_map()` to transform each file as a separate nested dataset,
  # and then concatenate their contents sequentially into a single "flat" dataset.
  # * Skip the first line (header row).
  # * Filter out lines beginning with "#" (comments).
  dataset = dataset.flat_map(
      lambda filename: (
          tf.data.TextLineDataset(filename)
          .skip(1)
          .filter(lambda line: tf.not_equal(tf.substr(line, 0, 1), "#"))))
#+END_SRC

** Consuming CSV data
CSV 格式文件也是很常见的文件格式. *tf.contrib.data.CsvDataset* 类支持从一个或者
多个 CSV 格式文件中读取样本.通过提供一个或者多个文件名和默认类型列表,CsvDataset
可以解析和返回对应类型一样的样本.和其他的文件格式 Dataset 一样,可以使用 tf.Tensor 作
为 filenames,通过输入 tf.placehodler(tf.string)作为参数特化数据库:
#+BEGIN_SRC python
  # Creates a dataset that reads all of the records from two CSV files, each with
  # eight float columns
  filenames = ["/var/data/file1.csv", "/var/data/file2.csv"]
  record_defaults = [tf.float32] * 8   # Eight required float columns
  dataset = tf.contrib.data.CsvDataset(filenames, record_defaults)
#+END_SRC

由于 Csv 允许元素缺失,所以也可以提供默认值来填充:
#+BEGIN_SRC python
  # Creates a dataset that reads all of the records from two CSV files, each with
  # four float columns which may have missing values
  record_defaults = [[0.0]] * 8
  dataset = tf.contrib.data.CsvDataset(filenames, record_defaults)
#+END_SRC

默认 CsvDataset 会将文件的每一行和每一列都解析作为样本,有时不是每一行和每一列都是
有效的.可以通过 *header* 和 *select_cols* 参数来过滤掉:
#+BEGIN_SRC python
  # Creates a dataset that reads all of the records from two CSV files with
  # headers, extracting float data from columns 2 and 4.
  record_defaults = [[0.0]] * 2  # Only provide defaults for the selected columns
  dataset = tf.contrib.data.CsvDataset(filenames, record_defaults, header=True, select_cols=[2,4])
#+END_SRC

* Preprocessing data with Dataset.map()
*Dataset.map(f)* 转换函数会将函数 *f* 应用到数据集中的每个样本,然后产生新的数据
集.函数 *f* 接受样本元素,执行相关转换操作,返回转换后的元素作为新的数据集的样本.

如下显示了 *Dataset.map()* 的一些例子.

