publish/machin-learning/machine-learing-frameworks/tensorflow/guide/high-level-apis/importing-data.html

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">Consuming TFRecord data</h3>
<div class="outline-text-3" id="text-2-2">
<p>
<b>tf.data</b> 支持多种文件格式,可以用来处理无法存储在内存中的数据.例如: TFRecord 文
件格式为 TensorFlow 存储的二进制文件格式. <b>tf.data.TFRecordDataset</b> 类可以用来流式
遍历 TFRecord 文件:
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Creates a dataset that reads all of the examples from two files.</span>
<span style="font-weight: bold; font-style: italic;">filenames</span> = [<span style="color: #daa520; font-style: italic;">"/var/data/file1.tfrecord"</span>, <span style="color: #daa520; font-style: italic;">"/var/data/file2.tfrecord"</span>]
<span style="font-weight: bold; font-style: italic;">dataset</span> = tf.data.TFRecordDataset(filenames)
</pre>
</div>

<p>
TFRecordDataset 的初始化参数 filenames 可以是字符串,字符串列表或者字符串的张量.如
果有两个文件,一个训练文件,一个验证文件,那么可以使用 <b>tf.placeholder(tf.string)</b>
来代表文件名,采取不同文件名来初始化迭代器:
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">filenames</span> = tf.placeholder(tf.string, shape=[<span style="font-weight: bold; text-decoration: underline;">None</span>])
<span style="font-weight: bold; font-style: italic;">dataset</span> = tf.data.TFRecordDataset(filenames)
<span style="font-weight: bold; font-style: italic;">dataset</span> = dataset.<span style="font-weight: bold;">map</span>(...)  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Parse the record into tensors.</span>
<span style="font-weight: bold; font-style: italic;">dataset</span> = dataset.repeat()  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Repeat the input indefinitely.</span>
<span style="font-weight: bold; font-style: italic;">dataset</span> = dataset.batch(32)
<span style="font-weight: bold; font-style: italic;">iterator</span> = dataset.make_initializable_iterator()

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">You can feed the initializer with the appropriate filenames for the current</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">phase of execution, e.g. training vs. validation.</span>

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Initialize `iterator` with training data.</span>
<span style="font-weight: bold; font-style: italic;">training_filenames</span> = [<span style="color: #daa520; font-style: italic;">"/var/data/file1.tfrecord"</span>, <span style="color: #daa520; font-style: italic;">"/var/data/file2.tfrecord"</span>]
sess.run(iterator.initializer, feed_dict={filenames: training_filenames})

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Initialize `iterator` with validation data.</span>
<span style="font-weight: bold; font-style: italic;">validation_filenames</span> = [<span style="color: #daa520; font-style: italic;">"/var/data/validation1.tfrecord"</span>, ...]
sess.run(iterator.initializer, feed_dict={filenames: validation_filenames})
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3">Consuming text data</h3>
<div class="outline-text-3" id="text-2-3">
<p>
<b>tf.data.TextLineDataset</b> 用来支持从文本文件创建 Dataset.类似 TFRecordDataset 一
 样,可以接受一个 <b>tf.Tensor</b> 作为 filenames,然后参数特化迭代器:
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">filenames</span> = [<span style="color: #daa520; font-style: italic;">"/var/data/file1.txt"</span>, <span style="color: #daa520; font-style: italic;">"/var/data/file2.txt"</span>]
<span style="font-weight: bold; font-style: italic;">dataset</span> = tf.data.TextLineDataset(filenames)
</pre>
</div>

<p>
默认 TextLineDataset 会将文本文件中的每一行作为一个样本,有时候第一行有可能是描述
行,或者包含一些注视.这些行可以通过调用 <b>Dataset.skip()</b> 和 <b>Dataset.filter()</b> 转
换函数来过滤掉.可以调用 <b>Dataset.flat_map()</b> 来分别过滤对应文件的 Dataset:
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">filenames</span> = [<span style="color: #daa520; font-style: italic;">"/var/data/file1.txt"</span>, <span style="color: #daa520; font-style: italic;">"/var/data/file2.txt"</span>]

<span style="font-weight: bold; font-style: italic;">dataset</span> = tf.data.Dataset.from_tensor_slices(filenames)

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Use `Dataset.flat_map()` to transform each file as a separate nested dataset,</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">and then concatenate their contents sequentially into a single "flat" dataset.</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">* Skip the first line (header row).</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">* Filter out lines beginning with "#" (comments).</span>
<span style="font-weight: bold; font-style: italic;">dataset</span> = dataset.flat_map(
    <span style="color: #00bfff; font-weight: bold;">lambda</span> filename: (
        tf.data.TextLineDataset(filename)
        .skip(1)
        .<span style="font-weight: bold;">filter</span>(<span style="color: #00bfff; font-weight: bold;">lambda</span> line: tf.not_equal(tf.substr(line, 0, 1), <span style="color: #daa520; font-style: italic;">"#"</span>))))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4">Consuming CSV data</h3>
<div class="outline-text-3" id="text-2-4">
<p>
CSV 格式文件也是很常见的文件格式. <b>tf.contrib.data.CsvDataset</b> 类支持从一个或者
多个 CSV 格式文件中读取样本.通过提供一个或者多个文件名和默认类型列表,CsvDataset
可以解析和返回对应类型一样的样本.和其他的文件格式 Dataset 一样,可以使用 tf.Tensor 作
为 filenames,通过输入 tf.placehodler(tf.string)作为参数特化数据库:
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Creates a dataset that reads all of the records from two CSV files, each with</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">eight float columns</span>
<span style="font-weight: bold; font-style: italic;">filenames</span> = [<span style="color: #daa520; font-style: italic;">"/var/data/file1.csv"</span>, <span style="color: #daa520; font-style: italic;">"/var/data/file2.csv"</span>]
<span style="font-weight: bold; font-style: italic;">record_defaults</span> = [tf.float32] * 8   <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Eight required float columns</span>
<span style="font-weight: bold; font-style: italic;">dataset</span> = tf.contrib.data.CsvDataset(filenames, record_defaults)
</pre>
</div>

<p>
由于 Csv 允许元素缺失,所以也可以提供默认值来填充:
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Creates a dataset that reads all of the records from two CSV files, each with</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">four float columns which may have missing values</span>
<span style="font-weight: bold; font-style: italic;">record_defaults</span> = [[0.0]] * 8
<span style="font-weight: bold; font-style: italic;">dataset</span> = tf.contrib.data.CsvDataset(filenames, record_defaults)
</pre>
</div>

<p>
默认 CsvDataset 会将文件的每一行和每一列都解析作为样本,有时不是每一行和每一列都是
有效的.可以通过 <b>header</b> 和 <b>select_cols</b> 参数来过滤掉:
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Creates a dataset that reads all of the records from two CSV files with</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">headers, extracting float data from columns 2 and 4.</span>
<span style="font-weight: bold; font-style: italic;">record_defaults</span> = [[0.0]] * 2  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Only provide defaults for the selected columns</span>
<span style="font-weight: bold; font-style: italic;">dataset</span> = tf.contrib.data.CsvDataset(filenames, record_defaults, header=<span style="font-weight: bold; text-decoration: underline;">True</span>, select_cols=[2,4])
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Preprocessing data with Dataset.map()</h2>
<div class="outline-text-2" id="text-3">
<p>
<b>Dataset.map(f)</b> 转换函数会将函数 <b>f</b> 应用到数据集中的每个样本,然后产生新的数据
集.函数 <b>f</b> 接受样本元素,执行相关转换操作,返回转换后的元素作为新的数据集的样本.
</p>

<p>
如下显示了 <b>Dataset.map()</b> 的一些例子.
</p>
</div>
