notes/machin-learning/machine-learing-frameworks/tensorflow/guide/high-level-apis/importing-data.org
** Parsing tf.Example protocol buffer messages
从 TFRecord 文件格式读取的样本元素类型为 *tf.train.Example* protocol buffer message.每个
*tf.train.Example* 记录包含一个或多个特征,输入流需要将 ExamplePB 格式的特征转为张量:
#+BEGIN_SRC python
  # Transforms a scalar string `example_proto` into a pair of a scalar string and
  # a scalar integer, representing an image and its label, respectively.
  def _parse_function(example_proto):
    features = {"image": tf.FixedLenFeature((), tf.string, default_value=""),
                "label": tf.FixedLenFeature((), tf.int64, default_value=0)}
    parsed_features = tf.parse_single_example(example_proto, features)
    return parsed_features["image"], parsed_features["label"]

  # Creates a dataset that reads all of the examples from two files, and extracts
  # the image and label features.
  filenames = ["/var/data/file1.tfrecord", "/var/data/file2.tfrecord"]
  dataset = tf.data.TFRecordDataset(filenames)
  dataset = dataset.map(_parse_function)
#+END_SRC

** Decoding image data and resizing it
当输入为图像时,常常需要将不同分辨率的图像缩放到统一分辨率,从而实现多张图像实现批
次训练:
#+BEGIN_SRC python
  # Reads an image from a file, decodes it into a dense tensor, and resizes it
  # to a fixed shape.
  def _parse_function(filename, label):
    image_string = tf.read_file(filename)
    image_decoded = tf.image.decode_jpeg(image_string)
    image_resized = tf.image.resize_images(image_decoded, [28, 28])
    return image_resized, label

  # A vector of filenames.
  filenames = tf.constant(["/var/data/image1.jpg", "/var/data/image2.jpg", ...])

  # `labels[i]` is the label for the image in `filenames[i].
  labels = tf.constant([0, 37, ...])

  dataset = tf.data.Dataset.from_tensor_slices((filenames, labels))
  dataset = dataset.map(_parse_function)
#+END_SRC

** Applying arbitrary Python logic with tf.py_func()
为了性能问题,最好只采用 TensorFlow 的内置函数来预处理数据集.但是有时候确实需要调用
其他的 Python 库来处理输入数据.可以通过使用 *tf.py_func* 包括普通 Python 函数,将
Python 函数转为 TensorFlow 可以调用的操作:
#+BEGIN_SRC python
  import cv2

  # Use a custom OpenCV function to read the image, instead of the standard
  # TensorFlow `tf.read_file()` operation.
  def _read_py_function(filename, label):
    image_decoded = cv2.imread(filename.decode(), cv2.IMREAD_GRAYSCALE)
    return image_decoded, label

  # Use standard TensorFlow operations to resize the image to a fixed shape.
  def _resize_function(image_decoded, label):
    image_decoded.set_shape([None, None, None])
    image_resized = tf.image.resize_images(image_decoded, [28, 28])
    return image_resized, label

  filenames = ["/var/data/image1.jpg", "/var/data/image2.jpg", ...]
  labels = [0, 37, 29, 1, ...]

  dataset = tf.data.Dataset.from_tensor_slices((filenames, labels))
  dataset = dataset.map(
      lambda filename, label: tuple(tf.py_func(
          _read_py_function, [filename, label], [tf.uint8, label.dtype])))
  dataset = dataset.map(_resize_function)
#+END_SRC

* Batching dataset elements
** Simple batching
*Dataset.batch()* 可以将多个数据集中连续的样本元素堆叠成一个批次.每个批次组件内
 的张量都具有相同的形状:
 #+BEGIN_SRC python
   inc_dataset = tf.data.Dataset.range(100)
   dec_dataset = tf.data.Dataset.range(0, -100, -1)
   dataset = tf.data.Dataset.zip((inc_dataset, dec_dataset))
   batched_dataset = dataset.batch(4)

   iterator = batched_dataset.make_one_shot_iterator()
   next_element = iterator.get_next()

   print(sess.run(next_element))  # ==> ([0, 1, 2,   3],   [ 0, -1,  -2,  -3])
   print(sess.run(next_element))  # ==> ([4, 5, 6,   7],   [-4, -5,  -6,  -7])
   print(sess.run(next_element))  # ==> ([8, 9, 10, 11],   [-8, -9, -10, -11])
 #+END_SRC

** Batching tensors with padding
上面所有的样本元素都需要具有相同的维度.然而很多模型(序列模型)的输入数据长度不定.
*Dataset.padded_batch()* 可以通过填充数据来使得样本保持相同维度,从而实现批次训
练:
#+BEGIN_SRC python
  dataset = tf.data.Dataset.range(100)
  dataset = dataset.map(lambda x: tf.fill([tf.cast(x, tf.int32)], x))
  dataset = dataset.padded_batch(4, padded_shapes=[None])

  iterator = dataset.make_one_shot_iterator()
  next_element = iterator.get_next()

  print(sess.run(next_element))  # ==> [[0, 0, 0], [1, 0, 0], [2, 2, 0], [3, 3, 3]]
  print(sess.run(next_element))  # ==> [[4, 4, 4, 4, 0, 0, 0],
                                 #      [5, 5, 5, 5, 5, 0, 0],
                                 #      [6, 6, 6, 6, 6, 6, 0],
                                 #      [7, 7, 7, 7, 7, 7, 7]]
#+END_SRC

