publish/machin-learning/machine-learing-frameworks/tensorflow/guide/high-level-apis/importing-data.html

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">Parsing tf.Example protocol buffer messages</h3>
<div class="outline-text-3" id="text-3-1">
<p>
从 TFRecord 文件格式读取的样本元素类型为 <b>tf.train.Example</b> protocol buffer message.每个
<b>tf.train.Example</b> 记录包含一个或多个特征,输入流需要将 ExamplePB 格式的特征转为张量:
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Transforms a scalar string `example_proto` into a pair of a scalar string and</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">a scalar integer, representing an image and its label, respectively.</span>
<span style="color: #00bfff; font-weight: bold;">def</span> <span style="font-weight: bold;">_parse_function</span>(example_proto):
  <span style="font-weight: bold; font-style: italic;">features</span> = {<span style="color: #daa520; font-style: italic;">"image"</span>: tf.FixedLenFeature((), tf.string, default_value=<span style="color: #daa520; font-style: italic;">""</span>),
              <span style="color: #daa520; font-style: italic;">"label"</span>: tf.FixedLenFeature((), tf.int64, default_value=0)}
  <span style="font-weight: bold; font-style: italic;">parsed_features</span> = tf.parse_single_example(example_proto, features)
  <span style="color: #00bfff; font-weight: bold;">return</span> parsed_features[<span style="color: #daa520; font-style: italic;">"image"</span>], parsed_features[<span style="color: #daa520; font-style: italic;">"label"</span>]

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Creates a dataset that reads all of the examples from two files, and extracts</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">the image and label features.</span>
<span style="font-weight: bold; font-style: italic;">filenames</span> = [<span style="color: #daa520; font-style: italic;">"/var/data/file1.tfrecord"</span>, <span style="color: #daa520; font-style: italic;">"/var/data/file2.tfrecord"</span>]
<span style="font-weight: bold; font-style: italic;">dataset</span> = tf.data.TFRecordDataset(filenames)
<span style="font-weight: bold; font-style: italic;">dataset</span> = dataset.<span style="font-weight: bold;">map</span>(_parse_function)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2">Decoding image data and resizing it</h3>
<div class="outline-text-3" id="text-3-2">
<p>
当输入为图像时,常常需要将不同分辨率的图像缩放到统一分辨率,从而实现多张图像实现批
次训练:
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Reads an image from a file, decodes it into a dense tensor, and resizes it</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">to a fixed shape.</span>
<span style="color: #00bfff; font-weight: bold;">def</span> <span style="font-weight: bold;">_parse_function</span>(filename, label):
  <span style="font-weight: bold; font-style: italic;">image_string</span> = tf.read_file(filename)
  <span style="font-weight: bold; font-style: italic;">image_decoded</span> = tf.image.decode_jpeg(image_string)
  <span style="font-weight: bold; font-style: italic;">image_resized</span> = tf.image.resize_images(image_decoded, [28, 28])
  <span style="color: #00bfff; font-weight: bold;">return</span> image_resized, label

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">A vector of filenames.</span>
<span style="font-weight: bold; font-style: italic;">filenames</span> = tf.constant([<span style="color: #daa520; font-style: italic;">"/var/data/image1.jpg"</span>, <span style="color: #daa520; font-style: italic;">"/var/data/image2.jpg"</span>, ...])

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">`labels[i]` is the label for the image in `filenames[i].</span>
<span style="font-weight: bold; font-style: italic;">labels</span> = tf.constant([0, 37, ...])

<span style="font-weight: bold; font-style: italic;">dataset</span> = tf.data.Dataset.from_tensor_slices((filenames, labels))
<span style="font-weight: bold; font-style: italic;">dataset</span> = dataset.<span style="font-weight: bold;">map</span>(_parse_function)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3">Applying arbitrary Python logic with tf.py_func()</h3>
<div class="outline-text-3" id="text-3-3">
<p>
为了性能问题,最好只采用 TensorFlow 的内置函数来预处理数据集.但是有时候确实需要调用
其他的 Python 库来处理输入数据.可以通过使用 <b>tf.py_func</b> 包括普通 Python 函数,将
Python 函数转为 TensorFlow 可以调用的操作:
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #00bfff; font-weight: bold;">import</span> cv2

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Use a custom OpenCV function to read the image, instead of the standard</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">TensorFlow `tf.read_file()` operation.</span>
<span style="color: #00bfff; font-weight: bold;">def</span> <span style="font-weight: bold;">_read_py_function</span>(filename, label):
  <span style="font-weight: bold; font-style: italic;">image_decoded</span> = cv2.imread(filename.decode(), cv2.IMREAD_GRAYSCALE)
  <span style="color: #00bfff; font-weight: bold;">return</span> image_decoded, label

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Use standard TensorFlow operations to resize the image to a fixed shape.</span>
<span style="color: #00bfff; font-weight: bold;">def</span> <span style="font-weight: bold;">_resize_function</span>(image_decoded, label):
  image_decoded.set_shape([<span style="font-weight: bold; text-decoration: underline;">None</span>, <span style="font-weight: bold; text-decoration: underline;">None</span>, <span style="font-weight: bold; text-decoration: underline;">None</span>])
  <span style="font-weight: bold; font-style: italic;">image_resized</span> = tf.image.resize_images(image_decoded, [28, 28])
  <span style="color: #00bfff; font-weight: bold;">return</span> image_resized, label

<span style="font-weight: bold; font-style: italic;">filenames</span> = [<span style="color: #daa520; font-style: italic;">"/var/data/image1.jpg"</span>, <span style="color: #daa520; font-style: italic;">"/var/data/image2.jpg"</span>, ...]
<span style="font-weight: bold; font-style: italic;">labels</span> = [0, 37, 29, 1, ...]

<span style="font-weight: bold; font-style: italic;">dataset</span> = tf.data.Dataset.from_tensor_slices((filenames, labels))
<span style="font-weight: bold; font-style: italic;">dataset</span> = dataset.<span style="font-weight: bold;">map</span>(
    <span style="color: #00bfff; font-weight: bold;">lambda</span> filename, label: <span style="font-weight: bold;">tuple</span>(tf.py_func(
        _read_py_function, [filename, label], [tf.uint8, label.dtype])))
<span style="font-weight: bold; font-style: italic;">dataset</span> = dataset.<span style="font-weight: bold;">map</span>(_resize_function)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Batching dataset elements</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1">Simple batching</h3>
<div class="outline-text-3" id="text-4-1">
<p>
<b>Dataset.batch()</b> 可以将多个数据集中连续的样本元素堆叠成一个批次.每个批次组件内
 的张量都具有相同的形状:
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">inc_dataset</span> = tf.data.Dataset.<span style="font-weight: bold;">range</span>(100)
<span style="font-weight: bold; font-style: italic;">dec_dataset</span> = tf.data.Dataset.<span style="font-weight: bold;">range</span>(0, -100, -1)
<span style="font-weight: bold; font-style: italic;">dataset</span> = tf.data.Dataset.<span style="font-weight: bold;">zip</span>((inc_dataset, dec_dataset))
<span style="font-weight: bold; font-style: italic;">batched_dataset</span> = dataset.batch(4)

<span style="font-weight: bold; font-style: italic;">iterator</span> = batched_dataset.make_one_shot_iterator()
<span style="font-weight: bold; font-style: italic;">next_element</span> = iterator.get_next()

<span style="color: #00bfff; font-weight: bold;">print</span>(sess.run(next_element))  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">==&gt; ([0, 1, 2,   3],   [ 0, -1,  -2,  -3])</span>
<span style="color: #00bfff; font-weight: bold;">print</span>(sess.run(next_element))  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">==&gt; ([4, 5, 6,   7],   [-4, -5,  -6,  -7])</span>
<span style="color: #00bfff; font-weight: bold;">print</span>(sess.run(next_element))  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">==&gt; ([8, 9, 10, 11],   [-8, -9, -10, -11])</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2">Batching tensors with padding</h3>
<div class="outline-text-3" id="text-4-2">
<p>
上面所有的样本元素都需要具有相同的维度.然而很多模型(序列模型)的输入数据长度不定.
<b>Dataset.padded_batch()</b> 可以通过填充数据来使得样本保持相同维度,从而实现批次训
练:
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">dataset</span> = tf.data.Dataset.<span style="font-weight: bold;">range</span>(100)
<span style="font-weight: bold; font-style: italic;">dataset</span> = dataset.<span style="font-weight: bold;">map</span>(<span style="color: #00bfff; font-weight: bold;">lambda</span> x: tf.fill([tf.cast(x, tf.int32)], x))
<span style="font-weight: bold; font-style: italic;">dataset</span> = dataset.padded_batch(4, padded_shapes=[<span style="font-weight: bold; text-decoration: underline;">None</span>])

<span style="font-weight: bold; font-style: italic;">iterator</span> = dataset.make_one_shot_iterator()
<span style="font-weight: bold; font-style: italic;">next_element</span> = iterator.get_next()

<span style="color: #00bfff; font-weight: bold;">print</span>(sess.run(next_element))  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">==&gt; [[0, 0, 0], [1, 0, 0], [2, 2, 0], [3, 3, 3]]</span>
<span style="color: #00bfff; font-weight: bold;">print</span>(sess.run(next_element))  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">==&gt; [[4, 4, 4, 4, 0, 0, 0],</span>
                               <span style="font-weight: bold; font-style: italic;">#      </span><span style="font-weight: bold; font-style: italic;">[5, 5, 5, 5, 5, 0, 0],</span>
                               <span style="font-weight: bold; font-style: italic;">#      </span><span style="font-weight: bold; font-style: italic;">[6, 6, 6, 6, 6, 6, 0],</span>
                               <span style="font-weight: bold; font-style: italic;">#      </span><span style="font-weight: bold; font-style: italic;">[7, 7, 7, 7, 7, 7, 7]]</span>
</pre>
</div>
</div>
</div>
</div>
