notes/machin-learning/machine-learing-frameworks/tensorflow/guide/high-level-apis/importing-data.org
* Training workflows 
** Processing multiple epochs
*tf.data* 支持两种方法实现训练集的多次迭代训练.

最简单的方法是调用 *Dataset.repeat()* :
#+BEGIN_SRC python
  filenames = ["/var/data/file1.tfrecord", "/var/data/file2.tfrecord"]
  dataset = tf.data.TFRecordDataset(filenames)
  dataset = dataset.map(...)
  dataset = dataset.repeat(10)
  dataset = dataset.batch(32)
#+END_SRC

如果没有参数,那么数据集将无限循环输入. *Dataset.repeat* 只是将有限的数据循环使用,在
每次新的循环开始时候并不发出任何反馈.

如果想要在每次数据集迭代完成时收到一个通知,可以在训练循环中去捕获
*tf.errors.OutOfRangeError* .从而实现在每次数据集迭代完成后去收集一些信息:
#+BEGIN_SRC python
  filenames = ["/var/data/file1.tfrecord", "/var/data/file2.tfrecord"]
  dataset = tf.data.TFRecordDataset(filenames)
  dataset = dataset.map(...)
  dataset = dataset.batch(32)
  iterator = dataset.make_initializable_iterator()
  next_element = iterator.get_next()

  # Compute for 100 epochs.
  for _ in range(100):
    sess.run(iterator.initializer)
    while True:
      try:
        sess.run(next_element)
      except tf.errors.OutOfRangeError:
        break

    # [Perform end-of-epoch calculations here.]
#+END_SRC

** Randomly shuffling input data
*Dataset.shuffle()* 可以用来随机打乱训练集数据,算法类似于
*tf.RandomShuffleQueue*:内部保持一个规定长度的缓存,然后从缓存中随机挑选样本.
#+BEGIN_SRC python
  filenames = ["/var/data/file1.tfrecord", "/var/data/file2.tfrecord"]
  dataset = tf.data.TFRecordDataset(filenames)
  dataset = dataset.map(...)
  dataset = dataset.shuffle(buffer_size=10000)
  dataset = dataset.batch(32)
  dataset = dataset.repeat()
#+END_SRC

** Using high-level APIs
*tf.train.MonitoredTrainingSession* 接口简化了 TensorFlow 训练.
MonitoredTrainingSession 通过捕获 *tf.errors.OutOfRangeError* 来记录训练流程是
否结束,所以推荐使用 *Dataset.make_one_shot_iterator()* :
#+BEGIN_SRC python
  filenames = ["/var/data/file1.tfrecord", "/var/data/file2.tfrecord"]
  dataset = tf.data.TFRecordDataset(filenames)
  dataset = dataset.map(...)
  dataset = dataset.shuffle(buffer_size=10000)
  dataset = dataset.batch(32)
  dataset = dataset.repeat(num_epochs)
  iterator = dataset.make_one_shot_iterator()

  next_example, next_label = iterator.get_next()
  loss = model_function(next_example, next_label)

  training_op = tf.train.AdagradOptimizer(...).minimize(loss)

  with tf.train.MonitoredTrainingSession(...) as sess:
    while not sess.should_stop():
      sess.run(training_op)
#+END_SRC

在采用 *tf.estimator.Estimator* 来训练时, input_fn 参数直接返回一个 Dataset 对象
即可,整个 estimator 会自动创建迭代器并初始化:
#+BEGIN_SRC python
  def dataset_input_fn():
    filenames = ["/var/data/file1.tfrecord", "/var/data/file2.tfrecord"]
    dataset = tf.data.TFRecordDataset(filenames)

    # Use `tf.parse_single_example()` to extract data from a `tf.Example`
    # protocol buffer, and perform any additional per-record preprocessing.
    def parser(record):
      keys_to_features = {
          "image_data": tf.FixedLenFeature((), tf.string, default_value=""),
          "date_time": tf.FixedLenFeature((), tf.int64, default_value=""),
          "label": tf.FixedLenFeature((), tf.int64,
                                      default_value=tf.zeros([], dtype=tf.int64)),
      }
      parsed = tf.parse_single_example(record, keys_to_features)

      # Perform additional preprocessing on the parsed data.
      image = tf.image.decode_jpeg(parsed["image_data"])
      image = tf.reshape(image, [299, 299, 1])
      label = tf.cast(parsed["label"], tf.int32)

      return {"image_data": image, "date_time": parsed["date_time"]}, label

    # Use `Dataset.map()` to build a pair of a feature dictionary and a label
    # tensor for each example.
    dataset = dataset.map(parser)
    dataset = dataset.shuffle(buffer_size=10000)
    dataset = dataset.batch(32)
    dataset = dataset.repeat(num_epochs)

    # Each element of `dataset` is tuple containing a dictionary of features
    # (in which each value is a batch of values for that feature), and a batch of
    # labels.
    return dataset
#+END_SRC
