publish/machin-learning/machine-learing-frameworks/tensorflow/guide/high-level-apis/importing-data.html

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Training workflows</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1">Processing multiple epochs</h3>
<div class="outline-text-3" id="text-5-1">
<p>
<b>tf.data</b> 支持两种方法实现训练集的多次迭代训练.
</p>

<p>
最简单的方法是调用 <b>Dataset.repeat()</b> :
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">filenames</span> = [<span style="color: #daa520; font-style: italic;">"/var/data/file1.tfrecord"</span>, <span style="color: #daa520; font-style: italic;">"/var/data/file2.tfrecord"</span>]
<span style="font-weight: bold; font-style: italic;">dataset</span> = tf.data.TFRecordDataset(filenames)
<span style="font-weight: bold; font-style: italic;">dataset</span> = dataset.<span style="font-weight: bold;">map</span>(...)
<span style="font-weight: bold; font-style: italic;">dataset</span> = dataset.repeat(10)
<span style="font-weight: bold; font-style: italic;">dataset</span> = dataset.batch(32)
</pre>
</div>

<p>
如果没有参数,那么数据集将无限循环输入. <b>Dataset.repeat</b> 只是将有限的数据循环使用,在
每次新的循环开始时候并不发出任何反馈.
</p>

<p>
如果想要在每次数据集迭代完成时收到一个通知,可以在训练循环中去捕获
<b>tf.errors.OutOfRangeError</b> .从而实现在每次数据集迭代完成后去收集一些信息:
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">filenames</span> = [<span style="color: #daa520; font-style: italic;">"/var/data/file1.tfrecord"</span>, <span style="color: #daa520; font-style: italic;">"/var/data/file2.tfrecord"</span>]
<span style="font-weight: bold; font-style: italic;">dataset</span> = tf.data.TFRecordDataset(filenames)
<span style="font-weight: bold; font-style: italic;">dataset</span> = dataset.<span style="font-weight: bold;">map</span>(...)
<span style="font-weight: bold; font-style: italic;">dataset</span> = dataset.batch(32)
<span style="font-weight: bold; font-style: italic;">iterator</span> = dataset.make_initializable_iterator()
<span style="font-weight: bold; font-style: italic;">next_element</span> = iterator.get_next()

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Compute for 100 epochs.</span>
<span style="color: #00bfff; font-weight: bold;">for</span> _ <span style="color: #00bfff; font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(100):
  sess.run(iterator.initializer)
  <span style="color: #00bfff; font-weight: bold;">while</span> <span style="font-weight: bold; text-decoration: underline;">True</span>:
    <span style="color: #00bfff; font-weight: bold;">try</span>:
      sess.run(next_element)
    <span style="color: #00bfff; font-weight: bold;">except</span> tf.errors.OutOfRangeError:
      <span style="color: #00bfff; font-weight: bold;">break</span>

  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">[Perform end-of-epoch calculations here.]</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2">Randomly shuffling input data</h3>
<div class="outline-text-3" id="text-5-2">
<p>
<b>Dataset.shuffle()</b> 可以用来随机打乱训练集数据,算法类似于
<b>tf.RandomShuffleQueue</b>:内部保持一个规定长度的缓存,然后从缓存中随机挑选样本.
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">filenames</span> = [<span style="color: #daa520; font-style: italic;">"/var/data/file1.tfrecord"</span>, <span style="color: #daa520; font-style: italic;">"/var/data/file2.tfrecord"</span>]
<span style="font-weight: bold; font-style: italic;">dataset</span> = tf.data.TFRecordDataset(filenames)
<span style="font-weight: bold; font-style: italic;">dataset</span> = dataset.<span style="font-weight: bold;">map</span>(...)
<span style="font-weight: bold; font-style: italic;">dataset</span> = dataset.shuffle(buffer_size=10000)
<span style="font-weight: bold; font-style: italic;">dataset</span> = dataset.batch(32)
<span style="font-weight: bold; font-style: italic;">dataset</span> = dataset.repeat()
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3">Using high-level APIs</h3>
<div class="outline-text-3" id="text-5-3">
<p>
<b>tf.train.MonitoredTrainingSession</b> 接口简化了 TensorFlow 训练.
MonitoredTrainingSession 通过捕获 <b>tf.errors.OutOfRangeError</b> 来记录训练流程是
否结束,所以推荐使用 <b>Dataset.make_one_shot_iterator()</b> :
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">filenames</span> = [<span style="color: #daa520; font-style: italic;">"/var/data/file1.tfrecord"</span>, <span style="color: #daa520; font-style: italic;">"/var/data/file2.tfrecord"</span>]
<span style="font-weight: bold; font-style: italic;">dataset</span> = tf.data.TFRecordDataset(filenames)
<span style="font-weight: bold; font-style: italic;">dataset</span> = dataset.<span style="font-weight: bold;">map</span>(...)
<span style="font-weight: bold; font-style: italic;">dataset</span> = dataset.shuffle(buffer_size=10000)
<span style="font-weight: bold; font-style: italic;">dataset</span> = dataset.batch(32)
<span style="font-weight: bold; font-style: italic;">dataset</span> = dataset.repeat(num_epochs)
<span style="font-weight: bold; font-style: italic;">iterator</span> = dataset.make_one_shot_iterator()

<span style="font-weight: bold; font-style: italic;">next_example</span>, <span style="font-weight: bold; font-style: italic;">next_label</span> = iterator.get_next()
<span style="font-weight: bold; font-style: italic;">loss</span> = model_function(next_example, next_label)

<span style="font-weight: bold; font-style: italic;">training_op</span> = tf.train.AdagradOptimizer(...).minimize(loss)

<span style="color: #00bfff; font-weight: bold;">with</span> tf.train.MonitoredTrainingSession(...) <span style="color: #00bfff; font-weight: bold;">as</span> sess:
  <span style="color: #00bfff; font-weight: bold;">while</span> <span style="color: #00bfff; font-weight: bold;">not</span> sess.should_stop():
    sess.run(training_op)
</pre>
</div>

<p>
在采用 <b>tf.estimator.Estimator</b> 来训练时, input_fn 参数直接返回一个 Dataset 对象
即可,整个 estimator 会自动创建迭代器并初始化:
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #00bfff; font-weight: bold;">def</span> <span style="font-weight: bold;">dataset_input_fn</span>():
  <span style="font-weight: bold; font-style: italic;">filenames</span> = [<span style="color: #daa520; font-style: italic;">"/var/data/file1.tfrecord"</span>, <span style="color: #daa520; font-style: italic;">"/var/data/file2.tfrecord"</span>]
  <span style="font-weight: bold; font-style: italic;">dataset</span> = tf.data.TFRecordDataset(filenames)

  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Use `tf.parse_single_example()` to extract data from a `tf.Example`</span>
  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">protocol buffer, and perform any additional per-record preprocessing.</span>
  <span style="color: #00bfff; font-weight: bold;">def</span> <span style="font-weight: bold;">parser</span>(record):
    <span style="font-weight: bold; font-style: italic;">keys_to_features</span> = {
        <span style="color: #daa520; font-style: italic;">"image_data"</span>: tf.FixedLenFeature((), tf.string, default_value=<span style="color: #daa520; font-style: italic;">""</span>),
        <span style="color: #daa520; font-style: italic;">"date_time"</span>: tf.FixedLenFeature((), tf.int64, default_value=<span style="color: #daa520; font-style: italic;">""</span>),
        <span style="color: #daa520; font-style: italic;">"label"</span>: tf.FixedLenFeature((), tf.int64,
                                    default_value=tf.zeros([], dtype=tf.int64)),
    }
    <span style="font-weight: bold; font-style: italic;">parsed</span> = tf.parse_single_example(record, keys_to_features)

    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Perform additional preprocessing on the parsed data.</span>
    <span style="font-weight: bold; font-style: italic;">image</span> = tf.image.decode_jpeg(parsed[<span style="color: #daa520; font-style: italic;">"image_data"</span>])
    <span style="font-weight: bold; font-style: italic;">image</span> = tf.reshape(image, [299, 299, 1])
    <span style="font-weight: bold; font-style: italic;">label</span> = tf.cast(parsed[<span style="color: #daa520; font-style: italic;">"label"</span>], tf.int32)

    <span style="color: #00bfff; font-weight: bold;">return</span> {<span style="color: #daa520; font-style: italic;">"image_data"</span>: image, <span style="color: #daa520; font-style: italic;">"date_time"</span>: parsed[<span style="color: #daa520; font-style: italic;">"date_time"</span>]}, label

  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Use `Dataset.map()` to build a pair of a feature dictionary and a label</span>
  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">tensor for each example.</span>
  <span style="font-weight: bold; font-style: italic;">dataset</span> = dataset.<span style="font-weight: bold;">map</span>(parser)
  <span style="font-weight: bold; font-style: italic;">dataset</span> = dataset.shuffle(buffer_size=10000)
  <span style="font-weight: bold; font-style: italic;">dataset</span> = dataset.batch(32)
  <span style="font-weight: bold; font-style: italic;">dataset</span> = dataset.repeat(num_epochs)

  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Each element of `dataset` is tuple containing a dictionary of features</span>
  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">(in which each value is a batch of values for that feature), and a batch of</span>
  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">labels.</span>
  <span style="color: #00bfff; font-weight: bold;">return</span> dataset
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
